app/Http/Controllers/Backend/Products/CategoriesController.php

select * from `categories` where `categories`.`deleted_at` is null order by `sorting_order_level` desc limit 15 offset 0
select count(*) as aggregate from `categories` where `categories`.`deleted_at` is null
---
    public function index(Request $request)
    {
        $searchKey = null;
        $categories = Category::orderBy('sorting_order_level', 'desc');
        if ($request->search != null) {
            $categories = $categories->where('name', 'like', '%' . $request->search . '%');
            $searchKey = $request->search;
        }

        $categories = $categories->paginate(paginationNumber());

select * from `languages` where `is_active` = 1 and `code` = 'en' limit 1
select * from `categories` where `categories`.`id` = '2' and `categories`.`deleted_at` is null limit 1
select * from `categories` where `parent_id` = 0 and `id` != 2 and 1 = 1 and `level` <= 0 and `categories`.`deleted_at` is null order by `sorting_order_level` desc, `name` asc
select * from `brands` where `is_active` = 1 and `brands`.`deleted_at` is null
---
    public function edit(Request $request, $id)
    {
        $lang_key = $request->lang_key;
        $language = Language::where('is_active', 1)->where('code', $lang_key)->first();
        if (!$language) {
            flash(localize('Language you are trying to translate is not available or not active'))->error();
            return redirect()->route('admin.categories.index');
        }

        $category = Category::findOrFail($id);
        $categories = Category::where('parent_id', 0)
            ->where('id', '!=', $category->id)
            ->orderBy('sorting_order_level', 'desc')
            ->with('childrenCategories')
            ->whereNotIn('id', $this->childrenIds($category->id, true))
            ->where('level', '<=', $category->level)
            ->orderBy('name', 'asc')
            ->get();

        $brands = Brand::isActive()->get();

select * from `categories` where `categories`.`id` = '1' and `categories`.`deleted_at` is null limit 1
---
    public function update(Request $request)
    {
        $category = Category::findOrFail($request->id);

select * from `categories` where `parent_id` = 2 and `categories`.`deleted_at` is null order by `sorting_order_level` desc
---
    public function getImmediateChildren($id, $includeDeleted = false, $toArray = false)
    {
        $children = Category::where('parent_id', $id)->orderBy('sorting_order_level', 'desc')->get();