app/Http/Controllers/Backend/SettingsController.php

                    writeToEnvFile('APP_NAME', $value);
                }

                $settings = SystemSetting::where('entity', $type)->first();
---
select * from `system_settings` where `entity` = 'best_selling_products' limit 1